api/load-test.yml
config:
  target: "http://localhost:4000"
  phases:
    - duration: 30
      arrivalRate: 10
      rampTo: 100
      name: "Warm up API"
    - duration: 60
      arrivalRate: 100
      rampTo: 500
      name: "Sustained high load"
  engines:
    http: {}

scenarios:
  - name: "Spectator viewing live wall and brackets"
    flow:
      - get:
          url: "/api/tournaments"
      - get:
          url: "/api/tournaments/mega-stress-test-2026/public"
      - get:
          url: "/api/matches?tournamentId=mega-stress-test-2026&limit=200"
      - get:
          url: "/api/clubs"
      - get:
          url: "/api/tournaments/mega-stress-test-2026/categories"